
%% Определяется статическая задача дуформации композитной пластины
%% основные физические параметры
E1 = 130*1e9;
E3 = 2.5*1e9;
G13 = 2*1e9;
G31 = 2*1e9;
NU13 = 0.28;
NU31 = E3/E1*NU13;

h = 1e-02; % толщина пластины
n = cN;

B11 = h * E1; B33 = h * E3; B13 = G13 * h;
D11 = B11 * h * h /12; D13 = B13 * h * h /12;

%% нагрузка в начальный момент времени
n_zer = zeros(n);
zer_col = zeros(n,1);
one_col = ones(n,1); 

P1 = zer_col;
P2 = zer_col;
P3 = zer_col;
P4 = one_col;

%% краевые условия
u0 = 0;
w0 = 0;
ph0 = 0;
ga0 = 0;

T11_l = 0;
R1_l = 0;
M11_l = 0;
Q1_l = 0;
